Q-1 Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [40]:
import pandas as pd

import csv

data = [["data"],[4],[8],[15],[16],[23],[42]]

with open("data.csv","w") as f:
    reader = csv.writer(f)
    for i in data:
        reader.writerow(i)
        
df = pd.read_csv("data.csv")
df.columns
df['data']

0     4
1     8
2    15
3    16
4    23
5    42
Name: data, dtype: int64

Q-2 Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [41]:
li = [1,2,3,4,5,6,7,8,9,10]

Q-3 Create a Pandas DataFrame that contains the following data:

In [62]:
data = [['Name','Age','Gender'],['Alice',25,'Female'],['Bob','30','Male'],['Claire','27','Female']]

with open("data1.csv","w") as f:
    reader = csv.writer(f)

    for i in data:
        
        reader.writerow(i)

df6 = pd.read_csv("data1.csv")   
df6

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q-4 What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is an Structured Format like Tabular form eg :: Rows and Colums

for example : in Answer 3

Q-5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

we can manipulate data in pandas dataframes like we used head to fetch rows how much rows we want or we tail to fetch rows from last or we check dtypes of colums or we used to fetch multiple colums  

for eg : head fetch first 5 rows while tail fetch last 5 rows

In [63]:
df.head()

   data
0     4
1     8
2    15
3    16
4    23

In [64]:
df.tail()

   data
1     8
2    15
3    16
4    23
5    42

In [65]:
df.dtypes

data    int64
dtype: object

In [66]:
df.columns

Index(['data'], dtype='object')

Q-6 All Pandas data structures are value mutable (can be changed) and except Series all are size mutable

Q-7 Create a DataFrame using multiple Series. Explain with an example.

we use list for multiple series

In [69]:
df6[['Name','Age']]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27